app/controllers/movies_controller.rb

  def show
    id = params[:id] # retrieve movie ID from URI route
    @movie = Movie.find(id) # look up movie by unique ID
---
SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = 5 LIMIT 1

  def index
    #@movies = Movie.all
    #Collecting ratings value if any
    @ratings=params[:ratings] ? params[:ratings] : session[:ratings]

    @rparams=@ratings ? @ratings : Movie.ratings

    if !params[:sort] && !params[:sorder] && !params[:ratings]
      redirect_to :action=>:index, :sort=>session[:sort], :sorder=>session[:sorder], :ratings=>session[:ratings]
    end
    session.delete(:home_path)

    @filteredmovies=Movie.where(:rating=>@rparams)
    @movies =@filteredmovies.order(sort_field + " " + sort_field_order)
---
SELECT `movies`.* FROM `movies` WHERE `movies`.`rating` IN ('G', 'R', 'PG-13', 'PG') ORDER BY release_date asc
SELECT rating FROM `movies`

  def edit
    @movie = Movie.find params[:id]
---
SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = 5 LIMIT 1

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
SELECT `movies`.* FROM `movies` WHERE `movies`.`id` = 5 LIMIT 1
UPDATE `movies` SET `title` = 'Chocolate', `updated_at` = '2012-10-20 08:19:59' WHERE `movies`.`id` = 5